docs/extras.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-18 Sat 18:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Extras</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Extras</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3fc44bb">1. What is this?</a></li>
<li><a href="#orgf81b6a4">2. Principles</a></li>
<li><a href="#org373bd8f">3. <span class="todo TODO">TODO</span> Notes structure</a></li>
<li><a href="#org8cc4d1c">4. Todo-list</a></li>
<li><a href="#org0d8e066">5. Article/Broader reading ideas</a></li>
</ul>
</div>
</div>
<hr />
<p>
<a href="index.html">Homepage</a>
</p>
<div id="outline-container-org3fc44bb" class="outline-2">
<h2 id="org3fc44bb"><span class="section-number-2">1.</span> What is this?</h2>
<div class="outline-text-2" id="text-1">
<p>
A box of notes about the words &ldquo;Independent Study&rdquo;.
</p>
</div>
</div>
<div id="outline-container-orgf81b6a4" class="outline-2">
<h2 id="orgf81b6a4"><span class="section-number-2">2.</span> Principles</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd9ef660" class="outline-3">
<h3 id="orgd9ef660"><span class="section-number-3">2.1.</span> On Notes and the Course Website</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A lot of the work (the share will be lesser once a good system is established) are about the webpage and course.
</p>

<p>
That&rsquo;s intentional &#x2013; it&rsquo;s part of the course goals, to &ldquo;Build strong habits and a decent familiarity for further in-depth study or research in formal methods.&rdquo;
</p>

<p>
Well, part of strong habits is a good workflow - it&rsquo;ll serve as a way to organize my own knowledge base in the future! It&rsquo;s also just plainly therapeutic :) and serves as a hobby. I really really <i>really</i> love emacs.
</p>

<p>
And making the notes pretty and comprehensive is literally 60% of the grade. There is another related goal: &ldquo;Learn to effectively communicate formal methods concepts.&rdquo;
</p>
</div>
</div>
<div id="outline-container-org3818b1b" class="outline-3">
<h3 id="org3818b1b"><span class="section-number-3">2.2.</span> On metacognition, reflection</h3>
<div class="outline-text-3" id="text-2-2">
<p>
One of the ways &ldquo;Comprehension&rdquo; gets evaluated is by
</p>
<blockquote>
<p>
(reflecting) &ldquo;metacognitively about course progress and learning strategies and broader connections for each week&rdquo;.
</p>
</blockquote>

<p>
This involves:
</p>

<ul class="org-ul">
<li>Documenting the learning process. In rhetoric, we are taught that crafting arguments (e.g. essays) is a form of thinking. The process of writing is much more important than the actual product. Since we <b>already</b> have a book, it wouldn&rsquo;t make sense for the notes to <b>copy</b> the book. It&rsquo;s more of a <b>study journal</b> than it is notes.</li>
<li>Asking questions. I note down questions immediately&#x2013; as soon as I think of them in the notes.</li>
<li>Documenting the working-out of the exercises.</li>
<li>Relating the lesson with further concepts. This involves looking things up in the internet, in wikis, in academic resources, papers. I like to read a lot of type theory / formal methods / history of mathematics stuff and it will be a great way to consolidate concepts. This involves looking up concrete examples and industry applications.</li>
<li>Original writing. I plan to make original content - essays - about the interesting history surrounding theorem provers. I already have a post about Barendregt. Another idea is studying the origins of the ITP tactics - Frege, Euclid, Aristotle, Leibniz comes to mind. <code>reflexivity</code> is obviously a</li>
<li>Deep reading. Girard, Frege, Russell, Coquand, Per Martin Lof, Pierce all have so much interesting stuff to say about the theoretical stuff - mathematical logic.</li>
<li>An avoidance of AI tools. I love chatbots. I use them <b>a LOT</b>. But what I will never use it for is to do the hard work for me. Or even do the researching around for me. It&rsquo;s so fun to learn - AI robs you of that process. Independent study means independent study.,</li>
</ul>
</div>
</div>
<div id="outline-container-orgee4a8bd" class="outline-3">
<h3 id="orgee4a8bd"><span class="section-number-3">2.3.</span> Health and Wellbeing</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The student is required to prioritize their wellbeing and seek assistance if problems are encountered. In fact, working on this independent study actually improves the student&rsquo;s wellbeing! :)
</p>
</div>
</div>
</div>
<div id="outline-container-org373bd8f" class="outline-2">
<h2 id="org373bd8f"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Notes structure</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Title</li>
<li>Table of Contents</li>
<li>Summary
<ul class="org-ul">
<li>Terms</li>
</ul></li>
<li>Actual notes</li>
<li>Exercise Summary</li>
<li>Exercises</li>
<li>Questions</li>
<li>Metacognition section</li>
<li>Further reading</li>
<li>Next</li>
</ul>
</div>
</div>
<div id="outline-container-org8cc4d1c" class="outline-2">
<h2 id="org8cc4d1c"><span class="section-number-2">4.</span> Todo-list</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1697e0c" class="outline-4">
<h4 id="org1697e0c"><span class="done DONE">DONE</span> open github repo</h4>
</div>
<div id="outline-container-org55af6d3" class="outline-4">
<h4 id="org55af6d3"><span class="todo TODO">TODO</span> display commit message in the top of the webpage, or latest edit!</h4>
</div>
<div id="outline-container-org12501c6" class="outline-4">
<h4 id="org12501c6"><span class="todo TODO">TODO</span> link advisor and student&rsquo;s websites.</h4>
</div>
<div id="outline-container-org057f5b5" class="outline-4">
<h4 id="org057f5b5"><span class="todo TODO">TODO</span> github actions, org-publish</h4>
</div>
<div id="outline-container-orgd55119e" class="outline-4">
<h4 id="orgd55119e"><span class="todo TODO">TODO</span> create discord group, with discord-github notifications</h4>
</div>
<div id="outline-container-orgb22c817" class="outline-4">
<h4 id="orgb22c817"><span class="done DONE">DONE</span> fix spacing issues</h4>
</div>
<div id="outline-container-orgb57a640" class="outline-4">
<h4 id="orgb57a640"><span class="todo TODO">TODO</span> typography. embed iosevka font</h4>
</div>
<div id="outline-container-org1d22255" class="outline-4">
<h4 id="org1d22255"><span class="todo TODO">TODO</span> maybe revamp the way I do headlines</h4>
</div>
<div id="outline-container-org931d32e" class="outline-4">
<h4 id="org931d32e"><span class="todo TODO">TODO</span> Headlines should be collapsible</h4>
</div>
<div id="outline-container-org08c68d9" class="outline-4">
<h4 id="org08c68d9"><span class="todo TODO">TODO</span> links to attached LOCAL sf book</h4>
</div>
<div id="outline-container-orge876487" class="outline-4">
<h4 id="orge876487"><span class="todo TODO">TODO</span> add tags to sections</h4>
</div>
<div id="outline-container-org783d685" class="outline-4">
<h4 id="org783d685"><span class="todo TODO">TODO</span> make priority tags visible!</h4>
<div class="outline-text-4" id="text-org783d685">
</div>
<ul class="org-ul">
<li><a id="orgef01095"></a><span class="todo TODO">TODO</span> revamp how we display exercises. Maybe we should have a summary table showing the number of stars, completion, name, etc.<br /></li>
</ul>
</div>
<div id="outline-container-orge734bc9" class="outline-4">
<h4 id="orge734bc9"><span class="todo TODO">TODO</span> research org-roam and integrate it for a knowledge base type of organization.</h4>
</div>
<div id="outline-container-org6b67089" class="outline-4">
<h4 id="org6b67089"><span class="todo TODO">TODO</span> org-agenda integration. There should be a TODOs page where all the todo lists across the pages appear.</h4>
</div>
<div id="outline-container-org15cb5a3" class="outline-4">
<h4 id="org15cb5a3"><span class="todo TODO">TODO</span> make template pages for notes. A new note page should follow the note-structure in 1.14.1.; it should have a previous notes and next notes link, homepage link, back to top link. Files should link to the chapter Coq file.</h4>
</div>
<div id="outline-container-org370eede" class="outline-4">
<h4 id="org370eede"><span class="todo TODO">TODO</span> add homework submission platform. My own Gradescope????</h4>
</div>
</div>
<div id="outline-container-org0d8e066" class="outline-2">
<h2 id="org0d8e066"><span class="section-number-2">5.</span> Article/Broader reading ideas</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0cfa018" class="outline-4">
<h4 id="org0cfa018"><span class="todo TODO">TODO</span> History of proof theory</h4>
</div>

<div id="outline-container-org3a23e46" class="outline-4">
<h4 id="org3a23e46"><span class="todo TODO">TODO</span> Practical tips</h4>
</div>

<div id="outline-container-orgcd1e340" class="outline-4">
<h4 id="orgcd1e340"><span class="todo TODO">TODO</span> Coq applications</h4>
</div>

<div id="outline-container-org1dfc4ea" class="outline-4">
<h4 id="org1dfc4ea"><span class="todo TODO">TODO</span> Interesting developments with AI + ITPs</h4>
</div>

<div id="outline-container-orga609196" class="outline-4">
<h4 id="orga609196"><span class="todo TODO">TODO</span> Origins of tactics</h4>
<div class="outline-text-4" id="text-orga609196">
<p>
Euclid in particular comes to mind.
</p>
</div>
</div>
<div id="outline-container-org11c35ed" class="outline-4">
<h4 id="org11c35ed"><span class="todo TODO">TODO</span> On Brouwer&rsquo;s Automath vision</h4>
<div class="outline-text-4" id="text-org11c35ed">
<p>
I&rsquo;ve already written this! I just need to publish it now.
</p>
</div>
</div>
<div id="outline-container-org7b1b3d7" class="outline-4">
<h4 id="org7b1b3d7"><span class="todo TODO">TODO</span> Comparison of ITPs</h4>
<div class="outline-text-4" id="text-org7b1b3d7">
<p>
I am very interested in particular with Lean and Agda.
</p>
</div>
</div>
<div id="outline-container-org9d4e9e4" class="outline-4">
<h4 id="org9d4e9e4"><span class="todo TODO">TODO</span> Girard and Coquand and Martin-Lof</h4>
</div>

<div id="outline-container-orgd979572" class="outline-4">
<h4 id="orgd979572"><span class="todo TODO">TODO</span> HoTT</h4>
</div>

<div id="outline-container-org9f074d3" class="outline-4">
<h4 id="org9f074d3"><span class="todo TODO">TODO</span> The Logic Front of the Empiricist-Rationalist war</h4>
<div class="outline-text-4" id="text-org9f074d3">
<hr />
<p>
<a href="extras.html">Back to Top</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-01-18 Sat 18:26</p>
</div>
</body>
</html>
